{
    "nav_home": "Home",
    "nav_about": "System",
    "nav_timeline": "Log",
    "nav_projects": "Work",
    "nav_contact": "Contact",
    "hero_status": "SYSTEM ONLINE",
    "hero_description": "Game Programmer focused on building responsive game systems and refined player interactions using <span class=\"text-white font-bold\">C#</span> and <span class=\"text-white font-bold\">Unity</span>.",
    "hero_cta_primary": "View Work",
    "hero_cta_cv": "Download CV",
    "hero_cta_secondary": "Contact",
    "hero_scroll": "Scroll",
    "about_title": "System Info",
    "about_subtitle": "WHO_AM_I.JSON",
    "about_label": "About me",
    "about_download_cv": "Download CV",
    "header_cv": "CV",
    "about_bio": "Hi, my name is <strong class=\"text-white\">Márcio Rosendo</strong>. I am 21 years old and hold a degree in <strong class=\"text-white\">Digital Games</strong> from <strong class=\"text-white\">Faculdade Méliès</strong>. I approach new challenges with a structured mindset and a strong curiosity for understanding how systems work and evolve. <br><br>I have been working with game development in <strong class=\"text-white\">Unity</strong> for over 2 years, focused on building gameplay systems and interactive mechanics. This mindset reflects directly in my code: I aim to write <strong class=\"text-white\">clean</strong>, <strong class=\"text-white\">maintainable</strong>, and <strong class=\"text-white\">well-structured</strong> solutions that support collaboration and long-term scalability. <br><br>I have solid experience in both <strong class=\"text-white\">single-player</strong> and <strong class=\"text-white\">multiplayer</strong> projects, working with <strong class=\"text-white\">networking solutions</strong> such as <strong class=\"text-white\">Photon PUN</strong> and <strong class=\"text-white\">WebSockets</strong>. My work spans a wide architectural range, from <strong class=\"text-white\">data-driven and structural patterns</strong> to <strong class=\"text-white\">state-oriented and behavior-focused systems</strong>. I typically own features end to end, with a strong focus on technical stability and delivering a highly polished player experience.",
    "timeline_title": "Career Log",
    "timeline_subtitle": "EXPERIENCE_DUMP",
    "timeline_job1_title": "Game Programmer",
    "timeline_job1_date": "Idle Journey • 04/2025 - 11/2025",
    "timeline_job1_desc": "Implemented core systems (inventory, cards, enchantments, card packs, WebSockets, and more) for a browser-based Idle RPG. Integrated with a Go-based server.",
    "timeline_job2_title": "Game Programmer",
    "timeline_job2_date": "Tape Us Out • 08/2024 - 04/2026",
    "timeline_job2_desc": "Developed multiplayer puzzle systems using Photon PUN. Handled debugging, optimization, and bug fixing for a 3D Co-op game.",
    "timeline_job3_title": "Producer/Programmer",
    "timeline_job3_date": "Echoes Of Suffering • 02/2024 - 06/2024",
    "timeline_job3_desc": "Led project management and implemented antagonist behavior for a 3D psychological horror game. Focused on performance optimization.",
    "timeline_job4_title": "Game Programmer",
    "timeline_job4_date": "I Bet'a Test • 08/2023 - 12/2023",
    "timeline_job4_desc": "Served as the main programmer on a comedic 2D puzzle game, building flexible gameplay systems, full UI, and dynamic narrative using Fungus.",
    "timeline_job1_tag_1": "Browser",
    "timeline_job1_tag_2": "Idle RPG",
    "timeline_job1_tag_3": "MMO-lite",
    "timeline_job1_tag_4": "3D",
    "timeline_job2_tag_1": "3D",
    "timeline_job2_tag_2": "Point & Click",
    "timeline_job2_tag_3": "Online Co-op",
    "timeline_job2_tag_4": "Puzzle",
    "timeline_job3_tag_1": "3D",
    "timeline_job3_tag_2": "Horror",
    "timeline_job3_tag_3": "Escape Room",
    "timeline_job3_tag_4": "First Person",
    "timeline_job4_tag_1": "2D",
    "timeline_job4_tag_2": "Point & Click",
    "timeline_job4_tag_3": "Puzzle",
    "timeline_job4_tag_4": "Narrative",
    "modal_challenge": "The Challenge",
    "modal_features": "Key Features",
    "modal_stack": "Tech Stack",
    "modal_view_itch": "View on itch.io",
    "modal_view_steam": "View on Steam",
    "modal_play_browser": "Play in Browser",
    "modal_case_study": "PROJETO",
    "code_snippet_disclaimer_summary": "Illustrative example inspired by a real system from this project.",
    "code_snippet_disclaimer_remarks": "Not a literal source file. Intentionally simplified to show how I would structure this today (names and details reduced).",
    "projects_title": "Main Projects",
    "projects_subtitle": "CLICK_TO_EXPAND",
    "project1_title": "Idle Journey",
    "project1_subtitle": "Browser-based idle RPG about long-term character progression.",
    "project2_title": "Tape Us Out",
    "project2_subtitle": "Online co-op point & click puzzle game with asymmetric roles.",
    "project3_title": "Echoes Of Suffering",
    "project3_subtitle": "First-person horror escape room driven by tension and audio cues.",
    "project4_title": "I Bet'a Test",
    "project4_subtitle": "2D narrative puzzle game with a sarcastic narrator and voiced story.",
    "project1_description": "Worked for five months with a small three-person team on a live browser-based Idle RPG. I joined the existing codebase as the primary programmer, taking responsibility for expanding, refactoring, and scaling core game systems. My work covered game architecture, UI foundations, backend integration, and production pipelines, delivering full gameplay features end-to-end. I built modular, scalable systems, integrated real-time communication via Go WebSockets with an event-driven backend, and developed complete UIs with smart tooltips, dynamic layouts, and WebGL-optimized workflows. I also created internal editor tools for data validation, CSV export, and ScriptableObject parsing reused across multiple areas, handled deployments using Docker, GCP, Cloudflare, and Nginx, and delivered over 100 bug fixes alongside large-scale refactoring while collaborating closely with the team and engaging directly with the international player community. The example below highlights the kind of data-driven UI structure I use for complex, evolving systems.",
    "project1_challenge": "Scaling and stabilizing a live browser-based Idle RPG by evolving an existing codebase with modular systems, real-time server communication, and reliable cloud persistence while maintaining WebGL performance.",
    "project1_features": [
        "Modular inventory system with drag & drop, tabs, multi-selection, and cloud persistence",
        "Data-driven UI view layer (render-only views) to keep systems scalable",
        "Card system with variants, drops, recycling, and configurable seasonal event shops",
        "Generic enchantment system with weighted substats and probability rules",
        "Contextual menu for UI/world interactions with dynamic options and real-time loot feedback",
        "Full WebSocket integration (Go backend) for event handling, validation, and persistence",
        "Designed and implemented enemies, bosses, equipment, and status effects within an evolving progression system",
        "Server-controlled inbox system enabling admin-level HTTP requests to send messages and rewards to any player",
        "Profiling, optimization, and large-scale refactoring to ensure long-term live stability",
        "Internal editor tools for data validation and CSV export pipelines",
        "100+ bug fixes across gameplay, UI, and backend integration"
    ],
    "project2_description": "Ongoing development of a multiplayer co-op puzzle game inspired by <strong class=\"text-white\">We Were Here</strong>. I was primarily responsible for implementing the core puzzle systems from the ground up, including gameplay logic, visual and audio feedback, and state synchronization between players. I also implemented the pause menu and several global gameplay systems. Multiplayer networking (Photon) was used to support these systems, with RPC-based flows ensuring consistent cooperative interactions between players with distinct roles.",
    "project2_challenge": "One puzzle had multiple physics-driven interactables with chained states. The core challenge wasn’t just syncing transforms — it was ensuring correct ownership at the exact interaction moment, otherwise both clients could apply authority and diverge. I solved it with a staged bootstrap + handshake: each client reports Ready after local setup, then the host assigns ownership deterministically and only then enables puzzle init + sync, removing start-up race conditions under latency.",
    "project2_features": [
        "Full implementation of core puzzle mechanics",
        "Puzzle-related visual and audio feedback",
        "RPC-based cooperative gameplay flows",
        "Synchronized puzzle and gameplay states between players",
        "Pause menu and global gameplay systems",
        "Strong focus on interaction clarity and cooperative readability"
    ],
    "project3_description": "A four-month horror project focused on building a tense, audio-driven gameplay experience. I implemented enemy awareness behavior built around player-generated sound events (steps, doors, interactions), mapping them into simple investigate vs alert responses feeding a state-driven AI loop for stealth gameplay. Alongside my programming work, I also acted as producer, coordinating the team and contributing to the overall game direction and development flow.",
    "project3_challenge": "Keeping stealth readable and consistent by turning noisy gameplay into reliable enemy responses (investigate/alert) inside a state-driven AI, while coordinating delivery across a multidisciplinary team.",
    "project3_features": [
        "State-based enemy AI systems with sound detection (investigate vs alert responses)",
        "Player sound events (steps/doors/interactions) driving enemy awareness changes",
        "Event-driven interactions tied to enemy awareness",
        "Production and team coordination across development"
    ],
    "project4_description": "A four-month Unity project focused on building a puzzle-driven experience with strong narrative integration. I was the main programmer responsible for implementing the entire game from scratch, including core gameplay systems, level logic, UI, and interaction flow. Exploration was structured around a room/wall inspection loop (switching views while tracking puzzle state), which also helped drive contextual narrative beats. I integrated the Fungus plugin to drive dynamic dialogue and voice-over logic, allowing character responses to adapt to player actions and provide contextual guidance for puzzle progression.",
    "project4_challenge": "Building a puzzle-focused experience where narrative dialogue actively supports player decision-making and progression through contextual feedback, tied to the player’s current room/wall context and puzzle state.",
    "project4_features": [
        "Full implementation of gameplay, UI, and interaction systems",
        "Room/wall view flow powering the core puzzle exploration loop",
        "Puzzle-driven level logic with contextual player guidance",
        "Dynamic dialogue and voice-over logic integrated via Fungus",
        "Narrative feedback adapting to player actions and puzzle state"
    ],
    "contact_title_1": "Let's Build",
    "contact_title_2": "Great Games.",
    "contact_desc": "Happy to talk about gameplay systems, technical problem-solving, or potential collaborations on game projects.",
    "contact_availability_status": "Open for opportunities",
    "contact_label_name": "Name",
    "contact_label_email": "Email",
    "contact_label_message": "Message",
    "contact_btn_send": "Send Message",
    "contact_btn_sending": "Sending...",
    "contact_btn_success": "Success!",
    "contact_placeholder_name": "User",
    "contact_placeholder_email": "user@example.com",
    "contact_placeholder_message": "Tell me about your project...",
    "contact_mini_email": "Email",
    "contact_mini_location": "Location",
    "contact_mini_location_value": "Brazil",
    "contact_social_label": "Connect:",
    "toast_email_copied": "Email copied to clipboard.",
    "toast_email_error": "Couldn't copy email. Please try again or copy manually.",
    "toast_cv_downloading": "Downloading CV...",
    "contact_success_title": "System Updated",
    "contact_success_message": "Message sent successfully.",
    "contact_success_button": "Send Another",
    "footer_analytics_notice_1": "This site uses",
    "footer_analytics_notice_2": "for navigation metrics."
}