{
    "nav_home": "Início",
    "nav_about": "Sistema",
    "nav_timeline": "Log",
    "nav_projects": "Trabalho",
    "nav_contact": "Contato",
    "hero_status": "SISTEMA ONLINE",
    "hero_description": "Game Programmer focado em construir sistemas de jogo responsivos e interações de jogador refinadas usando <span class=\"text-white font-bold\">C#</span> e <span class=\"text-white font-bold\">Unity</span>.",
    "hero_cta_primary": "Ver Trabalho",
    "hero_cta_cv": "Baixar CV",
    "hero_cta_secondary": "Contato",
    "hero_scroll": "Rolar",
    "about_title": "Info do Sistema",
    "about_subtitle": "QUEM_SOU_EU.JSON",
    "about_label": "Sobre mim",
    "about_download_cv": "Baixar CV",
    "header_cv": "CV",
    "about_bio": "Oi, me chamo <strong class=\"text-white\">Márcio Rosendo</strong>. Tenho 21 anos e sou formado em <strong class=\"text-white\">Jogos Digitais</strong> pela <strong class=\"text-white\">Faculdade Méliès</strong>. Gosto de encarar novos desafios de forma organizada e tenho curiosidade em entender como sistemas funcionam e evoluem ao longo do tempo. <br><br>Trabalho há mais de 2 anos com desenvolvimento na <strong class=\"text-white\">Unity</strong>, focado na construção de gameplay systems e mecânicas interativas. Isso se reflete no meu código: procuro escrever soluções <strong class=\"text-white\">limpas</strong>, <strong class=\"text-white\">manuteníveis</strong> e <strong class=\"text-white\">bem estruturadas</strong>, facilitando a colaboração e a escalabilidade ao longo do projeto. <br><br>Tenho experiência sólida em projetos <strong class=\"text-white\">single-player</strong> e <strong class=\"text-white\">multiplayer</strong>, trabalhando com <strong class=\"text-white\">soluções de rede</strong> como <strong class=\"text-white\">Photon PUN</strong> e <strong class=\"text-white\">WebSockets</strong>. Atuo em diferentes camadas de arquitetura, da estruturação de dados e <strong class=\"text-white\">sistemas centrais</strong> até a <strong class=\"text-white\">lógica de estados e comportamento em gameplay</strong>. Costumo assumir features de ponta a ponta, priorizando estabilidade técnica e uma experiência bem refinada.",
    "timeline_title": "Log de Carreira",
    "timeline_subtitle": "DUMP_DE_EXPERIENCIA",
    "timeline_job1_title": "Game Programmer",
    "timeline_job1_date": "Idle Journey • 04/2025 - 11/2025",
    "timeline_job1_desc": "Implementei sistemas principais (inventário, cartas, encantamentos, pacotes de cartas, WebSockets e mais) para um Idle RPG de navegador. Integrado com um servidor em Go.",
    "timeline_job2_title": "Game Programmer",
    "timeline_job2_date": "Tape Us Out • 08/2024 - 04/2026",
    "timeline_job2_desc": "Desenvolvi sistemas de puzzle multiplayer usando Photon PUN. Responsável por debugging, otimização e correção de bugs em um jogo Co-op 3D.",
    "timeline_job3_title": "Producer/Programmer",
    "timeline_job3_date": "Echoes Of Suffering • 02/2024 - 06/2024",
    "timeline_job3_desc": "Liderei o gerenciamento do projeto e implementei comportamentos de antagonista para um jogo de terror psicológico 3D. Foco em otimização de performance.",
    "timeline_job4_title": "Game Programmer",
    "timeline_job4_date": "I Bet'a Test • 08/2023 - 12/2023",
    "timeline_job4_desc": "Atuei como programador principal em um puzzle game 2D cômico, construindo sistemas flexíveis de gameplay, UI completa e narrativa dinâmica usando Fungus.",
    "timeline_job1_tag_1": "Browser",
    "timeline_job1_tag_2": "Idle RPG",
    "timeline_job1_tag_3": "MMO-lite",
    "timeline_job1_tag_4": "3D",
    "timeline_job2_tag_1": "3D",
    "timeline_job2_tag_2": "Point & Click",
    "timeline_job2_tag_3": "Co-op Online",
    "timeline_job2_tag_4": "Puzzle",
    "timeline_job3_tag_1": "3D",
    "timeline_job3_tag_2": "Terror",
    "timeline_job3_tag_3": "Escape Room",
    "timeline_job3_tag_4": "Primeira Pessoa",
    "timeline_job4_tag_1": "2D",
    "timeline_job4_tag_2": "Point & Click",
    "timeline_job4_tag_3": "Puzzle",
    "timeline_job4_tag_4": "Narrativa",
    "modal_challenge": "O Desafio",
    "modal_features": "Features Principais",
    "modal_stack": "Tech Stack",
    "modal_view_itch": "Ver no itch.io",
    "modal_view_steam": "Ver na Steam",
    "modal_play_browser": "Jogar no navegador",
    "modal_project_index": "PROJECT",
    "code_snippet_disclaimer_summary": "Exemplo ilustrativo inspirado em um sistema real deste projeto.",
    "code_snippet_disclaimer_remarks": "Não é um arquivo literal do código-fonte. É intencionalmente simplificado para mostrar como eu estruturaria isso hoje (nomes e detalhes reduzidos).",
    "projects_title": "Projetos Principais",
    "projects_subtitle": "CLIQUE_PARA_EXPANDIR",
    "project1_title": "Idle Journey",
    "project1_subtitle": "Idle RPG de navegador focado em progressão de personagem a longo prazo.",
    "project2_title": "Tape Us Out",
    "project2_subtitle": "Puzzle co-op online em 3D com papéis assimétricos em point & click.",
    "project3_title": "Echoes Of Suffering",
    "project3_subtitle": "Escape room de terror em primeira pessoa guiado por tensão e pistas sonoras.",
    "project4_title": "I Bet'a Test",
    "project4_subtitle": "Puzzle game 2D narrativo com narrador sarcástico e história dublada.",
    "project1_description": "Trabalhei por cinco meses com uma pequena equipe de três pessoas em um Idle RPG de navegador em produção. Entrei em uma base de código já existente como programador principal, assumindo a responsabilidade por expandir, refatorar e escalar sistemas centrais do jogo. Minha atuação abrangeu a arquitetura do jogo, bases de UI, integração com backend e pipelines de produção, entregando funcionalidades completas de gameplay (end-to-end). Construí sistemas modulares e escaláveis, integrei comunicação em tempo real via WebSockets em Go com um backend orientado a eventos e desenvolvi UIs completas com tooltips inteligentes, layouts dinâmicos e workflows otimizados para WebGL. Também criei ferramentas internas de editor para validação de dados, exportação CSV e parsing de ScriptableObjects reutilizadas em múltiplas áreas, cuidei de deployments usando Docker, GCP, Cloudflare e Nginx e entreguei mais de 100 correções de bugs junto com refatoração em larga escala, colaborando de perto com a equipe e interagindo diretamente com a comunidade internacional de jogadores. O exemplo abaixo destaca o tipo de UI data-driven que utilizo em sistemas complexos e em evolução.",
    "project1_challenge": "Escalar e estabilizar um Idle RPG de navegador em produção, evoluindo uma base de código existente com sistemas modulares, comunicação em tempo real com servidor e persistência em nuvem confiável, mantendo a performance em WebGL.",
    "project1_features": [
        "Sistema de inventário modular com drag & drop, abas, multisseleção e persistência em nuvem",
        "Camada de view de UI data-driven (camadas de apresentação puras) para manter o sistema escalável",
        "Sistema de cartas com variantes, drops, reciclagem e lojas sazonais configuráveis",
        "Sistema genérico de encantamentos com substats ponderados e regras de probabilidade",
        "Menu contextual para interações de UI/mundo com opções dinâmicas e feedback de loot em tempo real",
        "Integração completa WebSocket (backend em Go) para tratamento de eventos, validação e persistência",
        "Design e implementação de inimigos, chefes, equipamentos e efeitos de status em um sistema de progressão em evolução",
        "Sistema de inbox controlado pelo servidor permitindo requisições HTTP administrativas para enviar mensagens e recompensas a qualquer jogador",
        "Profiling, otimização e refatoração em larga escala para garantir estabilidade de longo prazo em produção",
        "Ferramentas internas de editor para validação de dados e pipelines de exportação CSV",
        "100+ correções de bugs entre gameplay, UI e integração com backend"
    ],
    "project2_description": "Desenvolvimento contínuo de um jogo de puzzle cooperativo multiplayer inspirado em <strong class=\"text-white\">We Were Here</strong>. Fui principalmente responsável por implementar os sistemas centrais de puzzles do zero, incluindo lógica de gameplay, feedback visual e sonoro e sincronização de estado entre jogadores. Também implementei o menu de pausa e diversos sistemas globais de gameplay. A rede multiplayer (Photon) foi utilizada para viabilizar esses sistemas, com fluxos baseados em RPC garantindo interações cooperativas consistentes entre jogadores com papéis distintos.",
    "project2_challenge": "Um dos puzzles tinha vários objetos interativos com física e estados encadeados. O desafio não era só sincronizar transform — era garantir o ownership no exato momento da interação, senão dois clientes aplicavam autoridade e o estado divergia. Resolvi com um bootstrapping em fases + handshake: cada cliente dá Ready após o setup local, então o host atribui ownership de forma determinística e só depois habilita init + sync, eliminando race conditions de start mesmo com latência.",
    "project2_features": [
        "Implementação completa das mecânicas centrais de puzzles",
        "Feedback visual e sonoro atrelado aos puzzles",
        "Fluxos cooperativos baseados em RPC",
        "Estados de puzzle e gameplay sincronizados entre jogadores",
        "Menu de pausa e sistemas globais de gameplay",
        "Foco forte na clareza das interações e legibilidade cooperativa"
    ],
    "project3_description": "Projeto de horror de quatro meses focado em construir uma experiência de gameplay tensa e orientada por áudio. Implementei comportamentos de percepção do inimigo baseados em eventos de som gerados pelo jogador (passos, portas, interações), mapeando isso em respostas simples de investigar vs alertar dentro de um loop de IA dirigido por estados para gameplay furtivo. Além do trabalho de programação, também atuei como produtor, coordenando a equipe e contribuindo para a direção geral do jogo e o fluxo de desenvolvimento.",
    "project3_challenge": "Manter a furtividade legível e consistente ao transformar gameplay “barulhento” em respostas confiáveis do inimigo (investigar/alertar) dentro de uma IA baseada em estados, enquanto coordenava a entrega em uma equipe multidisciplinar.",
    "project3_features": [
        "Sistemas de IA de inimigos baseados em estados com detecção por som (investigar vs alertar)",
        "Eventos de som do jogador (passos/portas/interações) dirigindo mudanças de percepção",
        "Interações orientadas a eventos ligadas à percepção dos inimigos",
        "Produção e coordenação de equipe ao longo do desenvolvimento"
    ],
    "project4_description": "Projeto em Unity de quatro meses focado em construir uma experiência de puzzle com forte integração narrativa. Fui o programador principal responsável por implementar o jogo inteiro do zero, incluindo sistemas centrais de gameplay, lógica de fases, UI e fluxo de interação. A exploração era estruturada em um loop de inspeção por sala/parede (trocando views enquanto acompanhava o estado do puzzle), o que também ajudava a conduzir beats narrativos contextuais. Integrei o plugin Fungus para dirigir diálogos dinâmicos e lógica de voice-over, permitindo que as respostas dos personagens se adaptem às ações do jogador e ofereçam orientação contextual para a progressão dos puzzles.",
    "project4_challenge": "Construir uma experiência focada em puzzles onde o diálogo narrativo apoia ativamente decisões e progressão por meio de feedback contextual, atrelado ao contexto atual de sala/parede e ao estado do puzzle.",
    "project4_features": [
        "Implementação completa de gameplay, UI e sistemas de interação",
        "Fluxo de views por sala/parede sustentando o loop central de exploração de puzzles",
        "Lógica de fases orientada a puzzles com orientação contextual ao jogador",
        "Diálogos dinâmicos e lógica de voice-over integrados via Fungus",
        "Feedback narrativo que se adapta às ações do jogador e ao estado do puzzle"
    ],
    "contact_title_1": "Vamos Construir",
    "contact_title_2": "Jogos Incríveis.",
    "contact_desc": "Aberto a conversar sobre sistemas de gameplay, solução técnica de problemas ou possíveis colaborações em projetos de jogos.",
    "contact_availability_status": "Aberto a oportunidades",
    "contact_label_name": "Nome",
    "contact_label_email": "Email",
    "contact_label_message": "Mensagem",
    "contact_btn_send": "Enviar Mensagem",
    "contact_btn_sending": "Enviando...",
    "contact_btn_success": "Sucesso!",
    "contact_placeholder_name": "Usuário",
    "contact_placeholder_email": "usuario@exemplo.com",
    "contact_placeholder_message": "Me conte sobre seu projeto...",
    "contact_mini_email": "Email",
    "contact_mini_location": "Localização",
    "contact_mini_location_value": "Brasil",
    "contact_social_label": "Conecte-se:",
    "toast_email_copied": "Email copiado para a área de transferência.",
    "toast_email_error": "Não foi possível copiar o email. Tente novamente ou copie manualmente.",
    "toast_cv_downloading": "Baixando o CV...",
    "contact_success_title": "Sistema Atualizado",
    "contact_success_message": "Mensagem enviada com sucesso.",
    "contact_success_button": "Enviar Outra",
    "footer_analytics_notice_1": "Este site usa",
    "footer_analytics_notice_2": "para métricas de navegação."
}